In [1]:
import sqlite3

In [2]:
conn = sqlite3.connect('demo.db')  
  
print("Opened database successfully");

Opened database successfully

### Create a table

In [3]:
conn.execute('''CREATE TABLE Employees 
       (ID INT PRIMARY KEY     NOT NULL, 
       NAME           TEXT    NOT NULL, 
       AGE            INT     NOT NULL, 
       ADDRESS        CHAR(50), 
       SALARY         REAL);''')  
print ("Table created successfully");

Table created successfully

In [4]:
conn.close()

### Insert Records

In [5]:
conn = sqlite3.connect('new.db')  
print ("Opened database successfully");  
  
conn.execute("INSERT INTO Employees (ID,NAME,AGE,ADDRESS,SALARY) VALUES (1, 'RK', 25, 'Ahmedabad', 45000.00 )");  
  
conn.execute("INSERT INTO Employees (ID,NAME,AGE,ADDRESS,SALARY) VALUES (2, 'Mansi', 22, 'Pune', 25000.00 )");  
  
conn.execute("INSERT INTO Employees (ID,NAME,AGE,ADDRESS,SALARY) VALUES (3, 'Mayur', 29, 'Rajkot', 200000.00 )");  
  
conn.execute("INSERT INTO Employees (ID,NAME,AGE,ADDRESS,SALARY) VALUES (4, 'Abhay', 22, 'Dhoraji', 65000.00 )");

conn.commit()  
print ("Records inserted successfully");  
conn.close()

Opened database successfully
Records inserted successfully

### Select Records

In [6]:
conn = sqlite3.connect('new.db')  
  
data = conn.execute("select * from Employees");  
  
for row in data:  
    print ("ID = ", row[0])  
    print ("NAME = ", row[1])  
    print ("AGE = ", row[2])
    print ("ADDRESS = ", row[3])  
    print ("SALARY = ", row[4], "\n")  
  
conn.close();

ID =  1
NAME =  RK
AGE =  25
ADDRESS =  Ahmedabad
SALARY =  45000.0

ID =  2
NAME =  Mansi
AGE =  22
ADDRESS =  Pune
SALARY =  25000.0

ID =  3
NAME =  Mayur
AGE =  29
ADDRESS =  Rajkot
SALARY =  200000.0

ID =  4
NAME =  Abhay
AGE =  22
ADDRESS =  Dhoraji
SALARY =  65000.0

### Update Records

In [10]:
# UPDATE table_name  
# SET column1 = value1, column2 = value2...., columnN = valueN  
# WHERE [condition]; 

conn = sqlite3.connect('new.db')  
  
data = conn.execute("UPDATE Employees SET SALARY  = 50000 WHERE ID = 4;   ");  
  
data = conn.execute("select * from Employees");  


for row in data:  
    print ("ID = ", row[0])  
    print ("NAME = ", row[1])  
    print ("AGE = ", row[2])
    print ("ADDRESS = ", row[3])  
    print ("SALARY = ", row[4], "\n")  
  
conn.close();

ID =  1
NAME =  RK
AGE =  25
ADDRESS =  Ahmedabad
SALARY =  45000.0

ID =  2
NAME =  Mansi
AGE =  22
ADDRESS =  Pune
SALARY =  25000.0

ID =  3
NAME =  Mayur
AGE =  29
ADDRESS =  Rajkot
SALARY =  200000.0

ID =  4
NAME =  Abhay
AGE =  22
ADDRESS =  Dhoraji
SALARY =  50000.0

### Delete Records

In [12]:
# DELETE FROM table_name  
# WHERE [conditions....................];; 

conn = sqlite3.connect('new.db')  
  
data = conn.execute("DELETE FROM Employees WHERE ID = 3; ");  
  
data = conn.execute("select * from Employees");  


for row in data:  
    print ("ID = ", row[0])  
    print ("NAME = ", row[1])  
    print ("AGE = ", row[2])
    print ("ADDRESS = ", row[3])  
    print ("SALARY = ", row[4], "\n")  
  
conn.close();

ID =  1
NAME =  RK
AGE =  25
ADDRESS =  Ahmedabad
SALARY =  45000.0

ID =  2
NAME =  Mansi
AGE =  22
ADDRESS =  Pune
SALARY =  25000.0

ID =  4
NAME =  Abhay
AGE =  22
ADDRESS =  Dhoraji
SALARY =  65000.0

### Dop Table

In [13]:
# DROP TABLE database_name.table_name;   


conn = sqlite3.connect('new.db')  
  
data = conn.execute("DROP TABLE Employees; ");  
  
data = conn.execute("select * from Employees");  


for row in data:  
    print ("ID = ", row[0])  
    print ("NAME = ", row[1])  
    print ("AGE = ", row[2])
    print ("ADDRESS = ", row[3])  
    print ("SALARY = ", row[4], "\n")  
  
conn.close();

OperationalError: no such table: Employees

**https://www.javatpoint.com/python-sqlite**

**RAJKUMAR ZALAVADIA - Mo: 7041645834 Email : rajzalavadia50@gmail.com**